Artifacts/code incubator/CaseFolder/With_icoFoam/NS/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topBoundary
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          90;
        startFace       11030;
    }
    subBoundary
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       11120;
    }
    upStream
    {
        type            patch;
        nFaces          60;
        startFace       11160;
    }
    downStream
    {
        type            patch;
        nFaces          60;
        startFace       11220;
    }
    bottomSymmetry
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          90;
        startFace       11280;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          11200;
        startFace       11370;
    }
)

// ************************************************************************* //
